import numpy as np

print("----------读取 txt 文件中的 NumPy 矩阵----------")
arr1 = np.loadtxt('data/test1.txt', delimiter=',')
print(arr1)

print("\n----------读取 CSV 文件中的 NumPy 矩阵----------")
arr2 = np.loadtxt('data/test1.csv', delimiter=',')
print(arr2)


"""
>>> Execution Result:
----------读取 txt 文件中的 NumPy 矩阵----------
[[ 1.62434536 -0.61175641 -0.52817175 -1.07296862]
 [ 0.86540763 -2.3015387   1.74481176 -0.7612069 ]
 [ 0.3190391  -0.24937038  1.46210794 -2.06014071]]

----------读取 CSV 文件中的 NumPy 矩阵----------
[[ 1.62434536 -0.61175641 -0.52817175 -1.07296862]
 [ 0.86540763 -2.3015387   1.74481176 -0.7612069 ]
 [ 0.3190391  -0.24937038  1.46210794 -2.06014071]]
"""
